ezois_ka/oooezoiskaobmen/src/Documents/ИсходящееСообщениеОСтраховомСлучаеФСС/ИсходящееСообщениеОСтраховомСлучаеФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееСообщениеОСтраховомСлучаеФСС</name>
  <basedOn>Document.БольничныйЛист</basedOn>
  <basedOn>Document.ВходящийЗапросФССДляРасчетаПособия</basedOn>
  <basedOn>Document.ОтветНаЗапросФССДляРасчетаПособия</basedOn>
  <attributes>
    <name>АктоваяЗаписьОРожденииДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктоваяЗаписьОРожденииНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПособия</name>
    <type>
      <types>EnumRef.ПособияНазначаемыеФСС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументыОснованияИсходящегоСообщенияОСтраховомСлучаеФСС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнойДокументОРожденииДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнойДокументОРожденииКемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнойДокументОРожденииНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнойДокументОРожденииСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрахователяФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНаЗапрос</name>
    <type>
      <types>DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьПроверкиПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускПоУходуДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускПоУходуДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перерасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнаниеСлучаяСтраховым</name>
    <type>
      <types>EnumRef.ПризнаниеСлучаяСтраховым</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>DefinedType.РодственникФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РебенокДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РебенокИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РебенокКодСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РебенокОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РебенокПол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РебенокСНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РебенокФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоОРожденииДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоОРожденииКемВыдано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоОРожденииНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоОРожденииСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникКатегория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникСНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправкаОРожденииДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправкаОРожденииКемВыдана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправкаОРожденииНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправкаОРожденииФорма</name>
    <type>
      <types>EnumRef.ФормыСправкиОРожденииРебенка</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительСФР</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредставителяСФР</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораТрудовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиПредставителяСФР</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС/РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС</name>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Зарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияНомерПроцесса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиЛогическогоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленОператору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиОператору</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрацияПротокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиЛогическогоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ИсходящееСообщениеОСтраховомСлучаеФСС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/ИсходящееСообщениеОСтраховомСлучаеФСС/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты") Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Документ.ИсходящееСообщениеОСтраховомСлучаеФСС";
		КомандаПечати.Идентификатор  = ИмяМакетаЗаявлениеОПособииПоУходу();
		КомандаПечати.Представление  = ПредставлениеМакетаЗаявлениеОПособииПоУходу();
		КомандаПечати.Порядок        = 30;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		Ежемесячное = Перечисления.ПособияНазначаемыеФСС.ЕжемесячноеПособиеПоУходуЗаРебенком;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидПособия", Ежемесячное);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивСсылок, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакетаЗаявлениеОПособииПоУходу()) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакетаЗаявлениеОПособииПоУходу(),
			ПредставлениеМакетаЗаявлениеОПособииПоУходу(),
			ТабличныйДокументЗаявлениеОПособииПоУходу(МассивСсылок, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.ИсходящееСообщениеОСтраховомСлучаеФСС);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)
	|	И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область СЭДО

Функция ТекстXML(Документ) Экспорт
	МенеджерXML = Обработки.ПостроительXML.Создать();
	МенеджерXML.ФорматДат = "ДФ=yyyy-MM-dd";
	
	// В корне 1 элемент: Информирование ФСС о жизненных событиях.
	КореньXML = МенеджерXML.ДобавитьУзел(МенеджерXML.ДеревоXML, "eventLife");
	МенеджерXML.ДобавитьПространствоИмен(КореньXML, "", "urn:ru:fss:integration:types:information:EventLife:v01");
	МенеджерXML.ДобавитьПространствоИмен(КореньXML, "common", "http://www.fss.ru/integration/types/common/v01");
	МенеджерXML.ДобавитьПространствоИмен(КореньXML, "person", "http://www.fss.ru/integration/types/person/v02");
	МенеджерXML.ДобавитьПространствоИмен(КореньXML, "xsi", "http://www.w3.org/2001/XMLSchema-instance");
	РодительXML = МенеджерXML.ДобавитьУзел(КореньXML, "event");
	
	МенеджерXML.ДобавитьУзел(РодительXML, "category", ВРег(УбратьПробелы(Документ.СотрудникКатегория)), Истина);
	
	ВидПособия = СЭДОФСС.СведенияОВидеПособия(Документ.ВидПособия);
	
	Особенности = ОсобенностиВыгрузки(Документ);
	
	Если Документ.Перерасчет Тогда
		// Инициация перерасчета. Запрос сведений о записи реестра выплаты.
		УзелДанных = МенеджерXML.ДобавитьУзел(РодительXML, "recalculation");
		// Идентификатор (BATCH_NO) записи реестра выплаты,
		// по которому необходимы сведения для формирования перерасчетного документа.
		МенеджерXML.ДобавитьУзел(УзелДанных, "batchNo", Документ.ИдентификаторСтрокиРеестра);
	
	ИначеЕсли ВидПособия.ЭтоОтпускПоУходу Тогда
		// Отпуск по уходу за ребёнком по достижении им возраста полутора лет.
		УзелДанных = МенеджерXML.ДобавитьУзел(РодительXML, "childCareVocation");
		ВыгрузитьСведенияОЗастрахованномЛице(Документ, МенеджерXML, УзелДанных, ВидПособия);
		ВыгрузитьИнформациюОРебенке(Документ, МенеджерXML, УзелДанных, Особенности);
		ВыгрузитьОснованияДляНазначенияОтпускаПоУходу(Документ, МенеджерXML, УзелДанных);
		ВыгрузитьВидДоговора(Документ, МенеджерXML, УзелДанных, Особенности);
		
	ИначеЕсли ВидПособия.ЭтоПособиеПриРождении Тогда
		// Рождение ребёнка.
		УзелДанных = МенеджерXML.ДобавитьУзел(РодительXML, "birthChild");
		ВыгрузитьСведенияОЗастрахованномЛице(Документ, МенеджерXML, УзелДанных, ВидПособия);
		ВыгрузитьИнформациюОРебенке(Документ, МенеджерXML, УзелДанных, Особенности);
		ВыгрузитьОснованияДляНазначенияПособияПриРождении(Документ, МенеджерXML, УзелДанных, Особенности);
		ВыгрузитьВидДоговора(Документ, МенеджерXML, УзелДанных, Особенности);
		
	ИначеЕсли ВидПособия.ЭтоЛН Тогда
		// Данные о закрытии листка нетрудоспособности.
		УзелДанных = МенеджерXML.ДобавитьУзел(РодительXML, "elnClosed");
		ВыгрузитьСведенияОЗастрахованномЛице(Документ, МенеджерXML, УзелДанных, ВидПособия);
		ВыгрузитьСведенияОбЭЛН(Документ, МенеджерXML, УзелДанных);
		ВыгрузитьВидДоговора(Документ, МенеджерXML, УзелДанных, Особенности);
		
	КонецЕсли;
	
	МенеджерXML.НачатьЗаписьВСтрокуXML(Ложь);
	СтрокаXML = МенеджерXML.СтрокаXML();
	Возврат СтрокаXML;
КонецФункции

Функция ТипСообщения(Документ = Неопределено) Экспорт
	Возврат 109;
КонецФункции

Процедура ПриЗаполненииПараметровОтправки(МассивСсылок, ТаблицаОтправки) Экспорт
	
	ИменаРеквизитовСтроки = "Ссылка, Номер, Дата, ФизическоеЛицо, Организация";
	ИменаРеквизитов = "Ссылка, Номер, Дата, ДатаОтправки, ФизическоеЛицо, Организация, ХранилищеXML, ПометкаУдаления, Проведен";
	Соответствие = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов);
	Для Каждого КлючИЗначение Из Соответствие Цикл
		Документ = КлючИЗначение.Значение;
		// Добавление строки отправки и заполнение представления.
		СтрокаОтправки = ТаблицаОтправки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОтправки, Документ, ИменаРеквизитовСтроки);
		СтрокаОтправки.ТипСообщения = ТипСообщения(Документ);
		СтрокаОтправки.ТекстXML     = Документ.ХранилищеXML.Получить();
		СтрокаОтправки.Отправить    = Ложь;
		СтрокаОтправки.ШаблонОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось отправить ответ на запрос ФСС для расчета пособия сотруднику %1:%2'"),
			СтрокаОтправки.ФизическоеЛицо,
			"%1");
		// Проверки и обновление вторичных данных документа перед отправкой.
		Если Документ.ПометкаУдаления Тогда
			СтрокаОтправки.ИндексКартинки = СЭДОФССКлиентСервер.ИндексКартинкиУдален();
			СтрокаОтправки.Результат = НСтр("ru = 'Документ помечен на удаление'");
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Документ.ДатаОтправки) Тогда
			СтрокаОтправки.ИндексКартинки = СЭДОФССКлиентСервер.ИндексКартинкиОтправлен();
			Если НачалоДня(Документ.ДатаОтправки) <= ТекущаяДатаСеанса() Тогда
				Текст = НСтр("ru = 'Документ уже отправлен %1'");
				СтрокаОтправки.Результат = СтрШаблон(Текст, Формат(Документ.ДатаОтправки, "ДЛФ=D"));
			Иначе
				Текст = НСтр("ru = 'Документ уже отправлен в %1'");
				СтрокаОтправки.Результат = СтрШаблон(Текст, Формат(Документ.ДатаОтправки, "ДФ=HH:mm"));
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		ДокументОбъект = Документ.Ссылка.ПолучитьОбъект();
		Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
			СтрокаОтправки.ИндексКартинки = СЭДОФССКлиентСервер.ИндексКартинкиПредупреждение();
			ЗаполнитьТекстОшибкиПроверкиЗаполнения(СтрокаОтправки, "");
			Если Не ДокументОбъект.ОтключитьПроверкиПроведения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// Проведение документа если требуется.
		ЕстьИзменения = ДокументОбъект.ОбновитьВторичныеДанные();
		СтрокаОтправки.Отправить = Истина;
		Если ЕстьИзменения Или Не ДокументОбъект.Проведен Тогда
			Попытка
				СтрокаОтправки.ИндексКартинки = СЭДОФССКлиентСервер.ИндексКартинкиПроведен();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ЗаполнитьЗначенияСвойств(СтрокаОтправки, ДокументОбъект, ИменаРеквизитовСтроки);
				СтрокаОтправки.ТекстXML = ДокументОбъект.ХранилищеXML.Получить();
			Исключение
				СтрокаОтправки.Отправить = Ложь;
				СтрокаОтправки.ИндексКартинки = СЭДОФССКлиентСервер.ИндексКартинкиОстановлен();
				СтрокаОтправки.ЗначениеРасшифровки = Документ.Ссылка;
				ТекстИсключения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаполнитьТекстОшибкиПроверкиЗаполнения(СтрокаОтправки, ТекстИсключения);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриПодготовкеВыбранныхДокументовКОтправке(МассивСсылок, ТаблицаОтправки) Экспорт
	// Действие не требуется.
КонецПроцедуры

// См. СЭДОФСС.ЗарегистрироватьНепосредственныйРезультатОтправкиДокумента.
Процедура ЗарегистрироватьРезультатОтправки(РезультатОтправки) Экспорт
	// Сначала записывается отправленный документ, т.к. его данные используются при обновлении регистров (кэшей).
	ДокументОбъект = РезультатОтправки.Ссылка.ПолучитьОбъект();
	ДокументОбъект.ДатаОтправки           = РезультатОтправки.ДатаОтправки;
	ДокументОбъект.ИдентификаторСообщения = РезультатОтправки.ИдентификаторСообщения;
	ДокументОбъект.Страхователь           = РезультатОтправки.Страхователь;
	ДокументОбъект.ГоловнаяОрганизация    = РезультатОтправки.ГоловнаяОрганизация;
	СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, Ложь, РежимЗаписиДокумента.Запись);
	
	// Затем записывается транспортный регистр.
	РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.ЗаполнитьПоДокументу(ДокументОбъект, РезультатОтправки);
	
	РезультатОтправки.Измененные.Добавить(ДокументОбъект.Ссылка);
КонецПроцедуры

// См. СЭДОФСС.ЗагрузитьРезультатДоставкиСообщенияСЭДО.
Процедура ЗагрузитьРезультатДоставкиСообщения109(Страхователь, Сообщение, Результат) Экспорт
	Таблица = РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.НайтиПоИдентификаторуСообщения(
		Страхователь,
		Сообщение.Идентификатор,
		Результат);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		// Сначала записывается отправленный документ, т.к. его данные используются при обновлении регистров (кэшей).
		Если Не Сообщение.ДоставленоФонду Тогда
			ДокументОбъект = СтрокаТаблицы.ИсходящийДокумент.ПолучитьОбъект();
			ДокументОбъект.ДатаОтправки           = '00010101';
			ДокументОбъект.ИдентификаторСообщения = "";
			СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, Ложь, РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		// Затем записывается транспортный регистр,
		// который при записи запускает обновление остальных регистров, зависящих от состояния отправки.
		РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.ЗаполнитьПоРезультатуДоставки(
			СтрокаТаблицы.ИсходящийДокумент,
			Сообщение);
		
		// Отметка для БРО и других потребителей что сообщение обработано.
		Результат.Обработано = Истина;
	КонецЦикла;
КонецПроцедуры

Функция ЗаголовокФормыОтправкиСведенийВФСС() Экспорт
	Возврат НСтр("ru = 'Отправка исходящих сообщений о страховых случаях в СФР через СЭДО'");
КонецФункции

#КонецОбласти

#Область СоставДокументов

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "Сотрудник");
КонецФункции

#КонецОбласти

#Область ФиксацияВторичныхДанныхВДокументах

Функция ПараметрыФиксацииВторичныхДанных(Документ = Неопределено) Экспорт
	Возврат ФиксацияВторичныхДанныхВДокументах.ПараметрыФиксации(ФиксируемыеРеквизиты(Документ));
КонецФункции

// Определяет по данным документа признак фиксации.
//
// Параметры:
//   Документ - ДокументОбъект.ИсходящееСообщениеОСтраховомСлучаеФСС, ДанныеФормыСтруктура
//
// Возвращаемое значение:
//   Булево
//
Функция ОбъектЗафиксирован(Документ) Экспорт
	Возврат Не Документ.ПометкаУдаления И ЗначениеЗаполнено(Документ.ДатаОтправки);
КонецФункции

#КонецОбласти

#Область МногофункциональныеДокументы

// Возвращает метаданные разделов документа.
//
// Возвращаемое значение:
//   Соответствие, Неопределено - Описание разделов документа.
//
Функция ОписаниеРазделовДанных() Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("МногофункциональныеДокументыБЗККлиентСервер");
		ВсеРазделы = Модуль.РазделыДанных();
		
		ОписаниеРазделовДанных = Новый Соответствие();
		
		ОписаниеРаздела = Модуль.НовыйОписаниеРазделаДанных();
		ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);
		ОписаниеРаздела.РеквизитСостояние    = "Проведен";
		ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
		
		ОписаниеРаздела = Модуль.НовыйОписаниеРазделаДанных();
		ОписаниеРазделовДанных.Вставить(ВсеРазделы.НачисленнаяЗарплата, ОписаниеРаздела);
		Возврат ОписаниеРазделовДанных;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Возвращает значения по которым будут проверяться права на документ.
//
// Параметры:
//   ДокументОбъект - ДокументОбъект, ДанныеФормыСтруктура
//
// Возвращаемое значение:
//   Структура - Значения доступа по которым будут проверяться права на документ
//
Функция ЗначенияДоступа(ДокументОбъект) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы") Тогда
		МодульМногофункциональныеДокументыБЗК = ОбщегоНазначения.ОбщийМодуль("МногофункциональныеДокументыБЗК");
		Возврат МодульМногофункциональныеДокументыБЗК.ЗначенияДоступаПоСоставуДокумента(
			ДокументОбъект,
			ДокументОбъект.Организация);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ФиксацияВторичныхДанныхВДокументах

Функция ФиксируемыеРеквизиты(Документ = Неопределено)
	ФиксируемыеРеквизиты = Новый Соответствие;
	
	Если Документ = Неопределено Тогда
		ЗаполненДокументОснование = Истина;
		ЗаполненСотрудник         = Истина;
		ЗаполненРебенок           = Истина;
	Иначе
		ЗаполненДокументОснование = ЗначениеЗаполнено(Документ.ДокументОснование);
		ЗаполненСотрудник         = ЗаполненДокументОснование Или ЗначениеЗаполнено(Документ.Сотрудник);
		ЗаполненРебенок           = ЗаполненДокументОснование Или ЗначениеЗаполнено(Документ.Ребенок);
	КонецЕсли;
	
	// Реквизиты организации.
	Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Группа.ОснованиеЗаполнения = "ТекущаяДатаСеанса";
	Группа.ИмяГруппы           = "ТекущаяДатаСеанса";
	Группа.ФиксацияГруппы      = Ложь;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ВерсияСпецификации");
	
	// Реквизиты оснований.
	Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Группа.ОснованиеЗаполнения      = "ДокументОснование";
	Группа.ИмяГруппы                = "ДокументОснование";
	Группа.ФиксацияГруппы           = Ложь;
	Группа.ОтображатьПредупреждение = Истина;
	
	Если ЗаполненДокументОснование Тогда
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "Организация");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "Сотрудник");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "Ребенок", Ложь);
		
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "НомерЛН");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ДатаНачалаСобытия");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ИдентификаторСтрокиРеестра");
		
		// Далее - фиксируемые группы без предупреждений.
		Группа.ФиксацияГруппы           = Истина;
		Группа.ОтображатьПредупреждение = Ложь;
		Группа.ИмяГруппы = "ОтпускПоУходу";
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ОтпускПоУходуДатаНачала");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ОтпускПоУходуДатаОкончания");
		Группа.ИмяГруппы = "СвидетельствоОРождении";
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СвидетельствоОРожденииСерия");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СвидетельствоОРожденииНомер");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СвидетельствоОРожденииДатаВыдачи");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СвидетельствоОРожденииКемВыдано");
		Группа.ИмяГруппы = "СправкаОРождении";
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СправкаОРожденииФорма");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СправкаОРожденииНомер");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СправкаОРожденииДатаВыдачи");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СправкаОРожденииКемВыдана");
		Группа.ИмяГруппы = "ИнойДокументОРождении";
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ИнойДокументОРожденииСерия");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ИнойДокументОРожденииНомер");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ИнойДокументОРожденииДатаВыдачи");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ИнойДокументОРожденииКемВыдан");
		Группа.ИмяГруппы = "АктоваяЗаписьОРождении";
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "АктоваяЗаписьОРожденииНомер");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "АктоваяЗаписьОРожденииДата");
	КонецЕсли;
	
	// Реквизиты организации.
	Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Группа.ОснованиеЗаполнения = "Организация";
	Группа.ИмяГруппы           = "Организация";
	Группа.ФиксацияГруппы      = Ложь;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "Страхователь");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "НомерСтрахователяФСС");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "КодПодчиненностиФСС");
	
	// Ответственное лицо ПредставительСФР.
	Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Группа.ОснованиеЗаполнения = "Организация";
	Группа.ИмяГруппы           = "ПредставительСФР";
	Группа.ФиксацияГруппы      = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ПредставительСФР");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ДолжностьПредставителяСФР");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "ОснованиеПодписиПредставителяСФР");
	
	// Сотрудник: Кадровые данные: Независимые.
	ГруппаКадровыеДанные = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	ГруппаКадровыеДанные.ОснованиеЗаполнения = "Сотрудник";
	ГруппаКадровыеДанные.ИмяГруппы           = "СотрудникКадровыеДанные";
	ГруппаКадровыеДанные.Используется        = ЗаполненСотрудник;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "СотрудникСНИЛС");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "СотрудникДатаРождения");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "СотрудникКатегория");
	
	// Кадровые данные: ФИО.
	Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Группа.ОснованиеЗаполнения = "Сотрудник";
	Группа.ИмяГруппы           = "ФИОСотрудника";
	Группа.ФиксацияГруппы      = Истина;
	Группа.Используется        = ЗаполненСотрудник;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СотрудникФамилия");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СотрудникИмя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "СотрудникОтчество");
	
	// Вид договора.
	ГруппаКадровыеДанные = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	ГруппаКадровыеДанные.ОснованиеЗаполнения = "Сотрудник";
	ГруппаКадровыеДанные.ИмяГруппы           = "ВидДоговора";
	ГруппаКадровыеДанные.ФиксацияГруппы      = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "ВидДоговораТрудовой", Ложь);
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "ВидДоговораГПХ", Ложь);
	
	// Ребенок.
	Если ЗаполненРебенок Тогда
		// Кадровые данные: Независимые.
		ГруппаКадровыеДанные = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
		ГруппаКадровыеДанные.ОснованиеЗаполнения = "Ребенок";
		ГруппаКадровыеДанные.ИмяГруппы           = "СотрудникКадровыеДанные";
		ГруппаКадровыеДанные.ФиксацияГруппы      = Ложь;
		
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "РебенокКодСвязи");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "РебенокДатаРождения");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "РебенокСНИЛС");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, ГруппаКадровыеДанные, "РебенокПол");
		
		// Кадровые данные: ФИО.
		Группа = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
		Группа.ОснованиеЗаполнения = "Ребенок";
		Группа.ИмяГруппы           = "ФИОРебенка";
		Группа.ФиксацияГруппы      = Истина;
		
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "РебенокФамилия");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "РебенокИмя");
		ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, "РебенокОтчество");
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(ФиксируемыеРеквизиты);
КонецФункции

Процедура ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Группа, ИмяРеквизита, ОтображатьПредупреждение = Неопределено)
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(
		ФиксируемыеРеквизиты,
		Группа,
		ИмяРеквизита,
		ОтображатьПредупреждение);
КонецПроцедуры

#КонецОбласти

#Область ТекстXML

Функция ПоддерживаемыеВерсииСпецификации() Экспорт
	Список = Новый СписокЗначений;
	Список.Добавить("", "2.20");
	Список.Добавить("2.34", "2.34");
	Список.Добавить("2.41", "2.41");
	Список.Добавить("2.45", "2.45");
	Возврат Список;
КонецФункции

Функция ОсобенностиВыгрузки(Документ) Экспорт
	ВерсияСпецификацииЧислом = СЭДОФСС.ВерсияЧислом(Документ.ВерсияСпецификации);
	Результат = Новый Структура;
	Результат.Вставить("Версия_2_34", ВерсияСпецификацииЧислом >= СЭДОФСС.ВерсияЧислом("2.34"));
	Результат.Вставить("Версия_2_41", ВерсияСпецификацииЧислом >= СЭДОФСС.ВерсияЧислом("2.41"));
	Результат.Вставить("Версия_2_45", ВерсияСпецификацииЧислом >= СЭДОФСС.ВерсияЧислом("2.45"));
	Возврат Результат;
КонецФункции

Процедура ВыгрузитьСведенияОбЭЛН(Документ, МенеджерXML, УзелДанных)
	МенеджерXML.ДобавитьУзел(УзелДанных, "lnCode", Документ.НомерЛН);
КонецПроцедуры

Процедура ВыгрузитьСведенияОЗастрахованномЛице(Документ, МенеджерXML, УзелДанных, ВидПособия)
	
	УзелСотрудник = МенеджерXML.ДобавитьУзел(УзелДанных, "insuredInfo");
	
	// СНИЛС.
	МенеджерXML.ДобавитьУзел(УзелСотрудник, "snils", УбратьПробелы(Документ.СотрудникСНИЛС));
	
	Если ВидПособия.ЭтоОтпускПоУходу Или ВидПособия.ЭтоПособиеПриРождении Тогда
		// ФИО.
		УзелФИО = МенеджерXML.ДобавитьУзел(УзелСотрудник, "fullName");
		МенеджерXML.ДобавитьУзел(УзелФИО, "person:firstName",  Документ.СотрудникИмя);
		МенеджерXML.ДобавитьУзел(УзелФИО, "person:lastName",   Документ.СотрудникФамилия);
		МенеджерXML.ДобавитьУзел(УзелФИО, "person:middleName", Документ.СотрудникОтчество, Истина);
		
		// Дата рождения.
		МенеджерXML.ДобавитьУзел(УзелСотрудник, "birthDate", Документ.СотрудникДатаРождения);
		
		// Код связи с ребенком: для 4го пособия - мать, отец, опекун; для 5го пособия - мать, отец, иной родственник, опекун.
		МенеджерXML.ДобавитьУзел(УзелСотрудник, "childRelType", Документ.РебенокКодСвязи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьВидДоговора(Документ, МенеджерXML, УзелДанных, Особенности)
	
	Если Особенности.Версия_2_41 Тогда
		УзелВидДоговора = МенеджерXML.ДобавитьУзел(УзелДанных, "contractsType");
		Если Документ.ВидДоговораТрудовой Тогда
			МенеджерXML.ДобавитьУзел(УзелВидДоговора, "contractType", "workerContract");
		КонецЕсли;
		Если Документ.ВидДоговораГПХ Тогда
			МенеджерXML.ДобавитьУзел(УзелВидДоговора, "contractType", "GPHcontract");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьИнформациюОРебенке(Документ, МенеджерXML, УзелДанных, Особенности)
	// Пример: МенеджерXML.ДобавитьУзел(Родитель, Имя, Значение = Неопределено, МожетОтсутствовать = Ложь, МожетБытьНеопределено = Ложь).
	
	УзелРебенок = МенеджерXML.ДобавитьУзел(УзелДанных, "childInfo");
	
	// ФИО.
	УзелФИО = МенеджерXML.ДобавитьУзел(УзелРебенок, "fullName");
	МенеджерXML.ДобавитьУзел(УзелФИО, "person:firstName",  Документ.РебенокИмя);
	МенеджерXML.ДобавитьУзел(УзелФИО, "person:lastName",   Документ.РебенокФамилия);
	МенеджерXML.ДобавитьУзел(УзелФИО, "person:middleName", Документ.РебенокОтчество, Истина);
	
	// Дата рождения.
	МенеджерXML.ДобавитьУзел(УзелРебенок, "birthDate", Документ.РебенокДатаРождения);
	
	// СНИЛС или пол.
	Если Особенности.Версия_2_45 Тогда
		Если ЗначениеЗаполнено(Документ.РебенокСНИЛС) Тогда
			МенеджерXML.ДобавитьУзел(УзелРебенок, "snils", УбратьПробелы(Документ.РебенокСНИЛС));
		КонецЕсли;
		Если ЗначениеЗаполнено(Документ.РебенокПол) Тогда
			Пол = ?(Документ.РебенокПол = Перечисления.ПолФизическогоЛица.Женский, "FEMALE", "MALE");
			МенеджерXML.ДобавитьУзел(УзелРебенок, "gender", Пол, Истина);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Документ.РебенокСНИЛС) Тогда
			МенеджерXML.ДобавитьУзел(УзелРебенок, "snils", УбратьПробелы(Документ.РебенокСНИЛС));
		Иначе
			Пол = ?(Документ.РебенокПол = Перечисления.ПолФизическогоЛица.Женский, "FEMALE", "MALE");
			МенеджерXML.ДобавитьУзел(УзелРебенок, "gender", Пол);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьОснованияДляНазначенияОтпускаПоУходу(Документ, МенеджерXML, УзелДанных)
	// Пример: МенеджерXML.ДобавитьУзел(Родитель, Имя, Значение = Неопределено, МожетОтсутствовать = Ложь, МожетБытьНеопределено = Ложь).
	
	УзелОснования = МенеджерXML.ДобавитьУзел(УзелДанных, "baseDocuments");
	
	// Период отпуска.
	УзелПериод = МенеджерXML.ДобавитьУзел(УзелОснования, "vocationPeriod");
	Если ЗначениеЗаполнено(Документ.ОтпускПоУходуДатаНачала) И ЗначениеЗаполнено(Документ.ОтпускПоУходуДатаОкончания) Тогда
		МенеджерXML.ДобавитьУзел(УзелПериод, "begin", Документ.ОтпускПоУходуДатаНачала);
		МенеджерXML.ДобавитьУзел(УзелПериод, "end",   Документ.ОтпускПоУходуДатаОкончания);
	КонецЕсли;
	
	УзелДокумент = МенеджерXML.ДобавитьУзел(УзелОснования, "identityDocument");
	
	Если ЗначениеЗаполнено(Документ.СвидетельствоОРожденииСерия)
		И ЗначениеЗаполнено(Документ.СвидетельствоОРожденииНомер)
		И ЗначениеЗаполнено(Документ.СвидетельствоОРожденииДатаВыдачи) Тогда
		// Свидетельство о рождении.
		Свидетельство = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthCertificate");
		МенеджерXML.ДобавитьУзел(Свидетельство, "series",    Документ.СвидетельствоОРожденииСерия);
		МенеджерXML.ДобавитьУзел(Свидетельство, "number",    Документ.СвидетельствоОРожденииНомер);
		МенеджерXML.ДобавитьУзел(Свидетельство, "issueDate", Документ.СвидетельствоОРожденииДатаВыдачи);
		МенеджерXML.ДобавитьУзел(Свидетельство, "issuer",    Документ.СвидетельствоОРожденииКемВыдано);
	ИначеЕсли ЗначениеЗаполнено(Документ.ИнойДокументОРожденииДатаВыдачи)
		И ЗначениеЗаполнено(Документ.ИнойДокументОРожденииНомер) Тогда
		// Иной документ подтверждающий рождение ребенка.
		УзелИное = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthDocOtherCountry");
		МенеджерXML.ДобавитьУзел(УзелИное, "series",    Документ.ИнойДокументОРожденииСерия, Истина, Ложь);
		МенеджерXML.ДобавитьУзел(УзелИное, "number",    Документ.ИнойДокументОРожденииНомер);
		МенеджерXML.ДобавитьУзел(УзелИное, "issueDate", Документ.ИнойДокументОРожденииДатаВыдачи);
		МенеджерXML.ДобавитьУзел(УзелИное, "issuer",    Документ.ИнойДокументОРожденииКемВыдан);
	КонецЕсли;
	
	// Актовая запись ЗАГС.
	Если ЗначениеЗаполнено(Документ.АктоваяЗаписьОРожденииНомер)
		И ЗначениеЗаполнено(Документ.АктоваяЗаписьОРожденииДата) Тогда
		УзелЗАГС = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthRecord");
		МенеджерXML.ДобавитьУзел(УзелЗАГС, "number",    Документ.АктоваяЗаписьОРожденииНомер);
		МенеджерXML.ДобавитьУзел(УзелЗАГС, "issueDate", Документ.АктоваяЗаписьОРожденииДата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьОснованияДляНазначенияПособияПриРождении(Документ, МенеджерXML, УзелДанных, Особенности)
	// Пример: МенеджерXML.ДобавитьУзел(Родитель, Имя, Значение = Неопределено, МожетОтсутствовать = Ложь, МожетБытьНеопределено = Ложь).
	
	УзелОснования = МенеджерXML.ДобавитьУзел(УзелДанных, "baseDocuments");
	
	УзелДокумент = МенеджерXML.ДобавитьУзел(УзелОснования, "identityDocument");
	
	Если ЗначениеЗаполнено(Документ.СвидетельствоОРожденииСерия)
		И ЗначениеЗаполнено(Документ.СвидетельствоОРожденииНомер)
		И ЗначениеЗаполнено(Документ.СвидетельствоОРожденииДатаВыдачи)
		И Не Особенности.Версия_2_34 Тогда
		// Свидетельство о рождении.
		Свидетельство = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthCertificate");
		МенеджерXML.ДобавитьУзел(Свидетельство, "series",    Документ.СвидетельствоОРожденииСерия);
		МенеджерXML.ДобавитьУзел(Свидетельство, "number",    Документ.СвидетельствоОРожденииНомер);
		МенеджерXML.ДобавитьУзел(Свидетельство, "issueDate", Документ.СвидетельствоОРожденииДатаВыдачи);
		МенеджерXML.ДобавитьУзел(Свидетельство, "issuer",    Документ.СвидетельствоОРожденииКемВыдано);
	ИначеЕсли ЗначениеЗаполнено(Документ.СправкаОРожденииФорма)
		И ЗначениеЗаполнено(Документ.СправкаОРожденииНомер) Тогда
		// Справка о рождении.
		КодФормы = Перечисления.ФормыСправкиОРожденииРебенка.КодЗначения(Документ.СправкаОРожденииФорма);
		УзелИное = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthReference");
		МенеджерXML.ДобавитьУзел(УзелИное, "number",    Документ.СправкаОРожденииНомер);
		МенеджерXML.ДобавитьУзел(УзелИное, "issueDate", Документ.СправкаОРожденииДатаВыдачи);
		МенеджерXML.ДобавитьУзел(УзелИное, "issuer",    Документ.СправкаОРожденииКемВыдана);
		МенеджерXML.ДобавитьУзел(УзелИное, "refType",   КодФормы);
	ИначеЕсли ЗначениеЗаполнено(Документ.ИнойДокументОРожденииДатаВыдачи)
		И ЗначениеЗаполнено(Документ.ИнойДокументОРожденииНомер) Тогда
		// Иной документ подтверждающий рождение ребенка.
		УзелИное = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthDocOtherCountry");
		МенеджерXML.ДобавитьУзел(УзелИное, "series",    Документ.ИнойДокументОРожденииСерия, Истина, Ложь);
		МенеджерXML.ДобавитьУзел(УзелИное, "number",    Документ.ИнойДокументОРожденииНомер);
		МенеджерXML.ДобавитьУзел(УзелИное, "issueDate", Документ.ИнойДокументОРожденииДатаВыдачи);
		МенеджерXML.ДобавитьУзел(УзелИное, "issuer",    Документ.ИнойДокументОРожденииКемВыдан);
	КонецЕсли;
	
	// Актовая запись ЗАГС.
	Если ЗначениеЗаполнено(Документ.АктоваяЗаписьОРожденииНомер)
		И ЗначениеЗаполнено(Документ.АктоваяЗаписьОРожденииДата) Тогда
		УзелЗАГС = МенеджерXML.ДобавитьУзел(УзелДокумент, "birthRecord");
		МенеджерXML.ДобавитьУзел(УзелЗАГС, "number",    Документ.АктоваяЗаписьОРожденииНомер);
		МенеджерXML.ДобавитьУзел(УзелЗАГС, "issueDate", Документ.АктоваяЗаписьОРожденииДата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПриЗаполненииПараметровОтправки

Функция ЗаполнитьТекстОшибкиПроверкиЗаполнения(СтрокаОтправки, ТекстИсключенияПриПроведении)
	СтрокаОтправки.Ошибки = ПолучитьСообщенияПользователю(Истина);
	
	Количество = СтрокаОтправки.Ошибки.Количество();
	Если Количество = 1 Тогда
		СтрокаОтправки.Результат = СтрокаОтправки.Ошибки[0].Текст;
	ИначеЕсли Количество > 1 Тогда
		СтрокаОтправки.Результат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 ошибка заполнения;;%1 ошибки заполнения;%1 ошибок заполнения;'"),
			Количество);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстИсключенияПриПроведении) Тогда
		Если СтрокаОтправки.Результат = "" Тогда
			СтрокаОтправки.Результат = СтрШаблон(НСтр("ru = 'Ошибка проведения: %1'"), ТекстИсключенияПриПроведении);
		Иначе
			СтрокаОтправки.Результат = СтрокаОтправки.Результат + ";" + Символы.ПС + СтрШаблон(НСтр("ru = 'И ошибка проведения: %1'"), ТекстИсключенияПриПроведении);
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ПФ_MXL_ЗаявлениеОНазначенииПособияПоУходуЗаРебенком

Функция ИмяМакетаЗаявлениеОПособииПоУходу()
	Возврат "ПФ_MXL_ЗаявлениеОНазначенииПособияПоУходуЗаРебенком_2025";
КонецФункции

Функция ПредставлениеМакетаЗаявлениеОПособииПоУходу()
	Возврат НСтр("ru = 'Заявление о назначении ежемесячного пособия по уходу за ребенком'");
КонецФункции

Функция ТабличныйДокументЗаявлениеОПособииПоУходу(МассивСсылок, ОбъектыПечати)
	ТабличныйДокумент = Неопределено;
	Кэш = Новый Соответствие;
	Макеты = Метаданные.Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.Макеты;
	
	ТаблицаДанных = ДанныеДляПечатиЗаявленияОНазначенииПособияПоУходуЗаРебенком(МассивСсылок);
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		КонтекстПечати = Кэш[СтрокаТаблицы.ИмяМакета];
		Если КонтекстПечати = Неопределено Тогда
			Макет = Макеты[СтрокаТаблицы.ИмяМакета];
			КонтекстПечати = УправлениеПечатьюБЗК.КонтекстПечати(Макет, , ОбъектыПечати, ТабличныйДокумент);
			СЭДОФСС.УстановитьСтандартныйОтступПечати(КонтекстПечати);
			ТабличныйДокумент = КонтекстПечати.ТабличныйДокумент;
			Кэш.Вставить(СтрокаТаблицы.ИмяМакета, КонтекстПечати);
		КонецЕсли;
		Данные = Обработки.ОбщиеФормыСЭДОФСС.ПустаяСтруктураДанныхДляПечатиЗаявленияОНазначенииПособияПоУходуЗаРебенком();
		ЗаполнитьЗначенияСвойств(Данные, СтрокаТаблицы);
		Обработки.ОбщиеФормыСЭДОФСС.НапечататьЗаявлениеОНазначенииПособияПоУходуЗаРебенком(КонтекстПечати, Данные);
	КонецЦикла;
	
	Возврат ?(ТабличныйДокумент = Неопределено, Новый ТабличныйДокумент, ТабличныйДокумент);
КонецФункции

Функция ДанныеДляПечатиЗаявленияОНазначенииПособияПоУходуЗаРебенком(МассивСсылок)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ДатаФорм2025", ПрямыеВыплатыПособийСоциальногоСтрахования.ДатаВступленияВСилуФорм2025());
	
	Макеты = Метаданные.Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.Макеты;
	Запрос.УстановитьПараметр("ИмяМакета2024", Макеты.ПФ_MXL_ЗаявлениеОНазначенииПособияПоУходуЗаРебенком_2024.Имя);
	Запрос.УстановитьПараметр("ИмяМакета2025", Макеты.ПФ_MXL_ЗаявлениеОНазначенииПособияПоУходуЗаРебенком_2025.Имя);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.Дата >= &ДатаФорм2025
	|			ТОГДА &ИмяМакета2025
	|		ИНАЧЕ &ИмяМакета2024
	|	КОНЕЦ КАК ИмяМакета,
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Дата КАК ДатаПодачи,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументов.ОтпускПоУходуДатаНачала КАК ДатаНачала,
	|	ДанныеДокументов.ОтпускПоУходуДатаОкончания КАК ДатаОкончания,
	|	ДанныеДокументов.ОтпускПоУходуДатаНачала КАК ДатаНачалаСобытия,
	|	ДанныеДокументов.ПредставительСФР КАК ПредставительСФР,
	|	ДанныеДокументов.ДолжностьПредставителяСФР КАК ДолжностьПредставителяСФР,
	|	ДанныеДокументов.РебенокФамилия КАК РебенокФамилия,
	|	ДанныеДокументов.РебенокИмя КАК РебенокИмя,
	|	ДанныеДокументов.РебенокОтчество КАК РебенокОтчество,
	|	ДанныеДокументов.РебенокДатаРождения КАК РебенокДатаРождения,
	|	ДанныеДокументов.РебенокСНИЛС КАК РебенокСНИЛС
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ИсходящееСообщениеОСтраховомСлучаеФСС КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументов.ДатаНачалаСобытия КАК ДатаНачалаСобытия
	|ПОМЕСТИТЬ ВТФизлица
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.ПредставительСФР,
	|	ДанныеДокументов.ДатаНачалаСобытия
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.ПредставительСФР <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	
	Запрос.Выполнить();
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФизлица",
		"ФизическоеЛицо,ДатаНачалаСобытия");
	ИменаПолей = "СтраховойНомерПФР, Фамилия, Имя, Отчество, ФИОПолные, ИОФамилия";
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(Описатель, Истина, ИменаПолей);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.ИмяМакета КАК ИмяМакета,
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.ДатаПодачи КАК ДатаПодачи,
	|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументов.ДатаНачала КАК ДатаНачала,
	|	ДанныеДокументов.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеДокументов.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	ДанныеДокументов.РебенокФамилия КАК РебенокФамилия,
	|	ДанныеДокументов.РебенокИмя КАК РебенокИмя,
	|	ДанныеДокументов.РебенокОтчество КАК РебенокОтчество,
	|	ДанныеДокументов.РебенокДатаРождения КАК РебенокДатаРождения,
	|	ДанныеДокументов.РебенокСНИЛС КАК РебенокСНИЛС,
	|	ДанныеДокументов.ПредставительСФР КАК УполномоченныйПредставитель,
	|	ДанныеДокументов.ДолжностьПредставителяСФР КАК УполномоченныйПредставительДолжность,
	|	ВЫБОР
	|		КОГДА ОрганизацияСправочник.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ОрганизацияСправочник.Наименование
	|		ИНАЧЕ ОрганизацияСправочник.НаименованиеПолное
	|	КОНЕЦ КАК СтраховательНаименование,
	|	ПредставительКадровыеДанные.ИОФамилия КАК УполномоченныйПредставительРасшифровкаПодписи,
	|	ПредставительКадровыеДанные.ФИОПолные КАК УполномоченныйПредставительФИО,
	|	ФизическоеЛицоКадровыеДанные.СтраховойНомерПФР КАК СНИЛС,
	|	ФизическоеЛицоКадровыеДанные.Фамилия КАК Фамилия,
	|	ФизическоеЛицоКадровыеДанные.Имя КАК Имя,
	|	ФизическоеЛицоКадровыеДанные.Отчество КАК Отчество
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияСправочник
	|		ПО ДанныеДокументов.Организация = ОрганизацияСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ПредставительКадровыеДанные
	|		ПО ДанныеДокументов.ПредставительСФР = ПредставительКадровыеДанные.ФизическоеЛицо
	|			И ДанныеДокументов.ДатаНачалаСобытия = ПредставительКадровыеДанные.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ФизическоеЛицоКадровыеДанные
	|		ПО ДанныеДокументов.ФизическоеЛицо = ФизическоеЛицоКадровыеДанные.ФизическоеЛицо
	|			И ДанныеДокументов.ДатаНачалаСобытия = ФизическоеЛицоКадровыеДанные.Период";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

Функция ИменаПолейТребуемыхКадровыхДанных() Экспорт
	ИменаПолей = 
	"ГоловнаяОрганизация,
	|Организация,
	|ФизическоеЛицо,
	|Фамилия,
	|Имя,
	|Отчество,
	|СтраховойНомерПФР,
	|ДатаРождения,
	|Страна";
	Возврат ИменаПолей;
КонецФункции

Функция УбратьПробелы(Строка, УбратьТире = Истина)
	Возврат СтроковыеФункцииБЗККлиентСервер.УбратьПробелы(Строка, УбратьТире);
КонецФункции

Функция КоличествоОжидаемыхСообщений(ГоловнаяОрганизация, Организации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС КАК Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Регистрации.ГоловнаяОрганизация = Организации.Ссылка
	|ГДЕ
	|	Регистрации.Состояние = &Отправлен
	|	И Регистрации.ДатаОтправки > &ДатаНачалаАктуальности
	|	И Регистрации.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И Организации.Ссылка В(&Организации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1
	|ИЗ
	|	РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС КАК Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Регистрации.ГоловнаяОрганизация = Организации.Ссылка
	|ГДЕ
	|	Регистрации.Состояние = &ОтправленОператору
	|	И Регистрации.ДатаОтправкиОператору > &ДатаНачалаАктуальности
	|	И Регистрации.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И Организации.Ссылка В(&Организации)";
	
	Запрос.УстановитьПараметр("Отправлен", Перечисления.СостоянияДокументаСЭДОФСС.Отправлен);
	Запрос.УстановитьПараметр("ОтправленОператору", Перечисления.СостоянияДокументаСЭДОФСС.ОтправленОператору);
	Запрос.УстановитьПараметр("ДатаНачалаАктуальности", ДатаНачалаАктуальности());
	
	Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Регистрации.ГоловнаяОрганизация = &ГоловнаяОрганизация", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		Запрос.УстановитьПараметр("Организации", Организации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО Регистрации.ГоловнаяОрганизация = Организации.Ссылка", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Организации.Ссылка В(&Организации)", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
КонецФункции

Функция ДатаНачалаАктуальности()
	Возврат НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
КонецФункции

#КонецОбласти

#КонецЕсли
